TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0g321x.h
/******************************************************************************
* Ignore unused variables                                                     *
******************************************************************************/

#if   defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/******************************************************************************
* Processor and Core Peripheral Section                                       *
******************************************************************************/

#define __CM0PLUS_REV           0x0001U       /* Core revision */
#define __MPU_PRESENT           0x0001U       /* MPU present */
#define __VTOR_PRESENT          0x0001U       /* VTOR present */
#define __NVIC_PRIO_BITS        0x0002U       /* Number of bits used for Priority Levels */
#define __Vendor_SysTickConfig  0x0000U       /* Set to 1 if different SysTick Config is used */

#include "core_cm0plus.h"                  /* Processor and core peripherals */

/******************************************************************************
* Peripheral headers                                                          *
******************************************************************************/
/** @addtogroup MSPM0G321X_Peripherals MSPM0G321X Peripherals
  MSPM0G321X Peripheral registers structures
  @{
*/

#include <ti/devices/msp/peripherals/hw_spgss.h>
#include <ti/devices/msp/peripherals/hw_unicomm.h>
#include <ti/devices/msp/peripherals/hw_unicommi2cc.h>
#include <ti/devices/msp/peripherals/hw_unicommi2ct.h>
#include <ti/devices/msp/peripherals/hw_unicommspi.h>
#include <ti/devices/msp/peripherals/hw_unicommuart.h>
#include <ti/devices/msp/peripherals/hw_adc12.h>
#include <ti/devices/msp/peripherals/hw_aesadv.h>
#include <ti/devices/msp/peripherals/hw_btimer.h>
#include <ti/devices/msp/peripherals/hw_comp.h>
#include <ti/devices/msp/peripherals/hw_crcp.h>
#include <ti/devices/msp/peripherals/hw_dma.h>
#include <ti/devices/msp/peripherals/hw_flashctl.h>
#include <ti/devices/msp/peripherals/hw_gpio.h>
#include <ti/devices/msp/peripherals/hw_gptimer.h>
#include <ti/devices/msp/peripherals/hw_iomux.h>
#include <ti/devices/msp/peripherals/hw_keystorectl.h>
#include <ti/devices/msp/peripherals/hw_lfss.h>
#include <ti/devices/msp/peripherals/hw_rtc.h>
#include <ti/devices/msp/peripherals/hw_mathacl.h>
#include <ti/devices/msp/peripherals/hw_mcan.h>
#include <ti/devices/msp/peripherals/hw_vref.h>
#include <ti/devices/msp/peripherals/hw_wuc.h>
#include <ti/devices/msp/peripherals/hw_wwdt.h>
#include <ti/devices/msp/peripherals/m0p/hw_cpuss.h>
#include <ti/devices/msp/peripherals/m0p/hw_debugss.h>
#include <ti/devices/msp/peripherals/m0p/hw_sysctl.h>
#include <ti/devices/msp/peripherals/m0p/hw_factoryregion.h>

#define __MSPM0_HAS_ADC12__
#define __MSPM0_HAS_AESADV__
#define __MSPM0_HAS_COMP__
#define __MSPM0_HAS_CRCP__
#define __MSPM0_HAS_GPIO__
#define __MSPM0_HAS_TIMER_A__
#define __MSPM0_HAS_TIMER_G__
#define __MSPM0_HAS_TIMER_B__
#define __MSPM0_HAS_KEYSTORE_CTL__
#define __MSPM0_HAS_MATHACL__
#define __MSPM0_HAS_MCAN__
#define __MSPM0_HAS_LFSS__
#define __MSPM0_HAS_RTC_B__
#define __MSPM0_HAS_IWDT__
#define __MSPM0_HAS_VREF__
#define __MSPM0_HAS_WWDT__
#define __MSPM0_HAS_IWDT__
#define __MCU_HAS_SPGSS__
#define __MCU_HAS_UNICOMM__
#define __MCU_HAS_UNICOMMUART__
#define __MCU_HAS_UNICOMMI2CC__
#define __MCU_HAS_UNICOMMI2CT__
#define __MCU_HAS_UNICOMMSPI__
#define __MSPM0_HAS_ECC__

/*@}*/ /* end of group MSPM0G321X_Peripherals */

/******************************************************************************
* Device and peripheral memory map                                            *
******************************************************************************/
/** @addtogroup MSPM0G321X_MemoryMap MSPM0G321X Memory Mapping
  @{
*/

#define ADC0_BASE                      (0x40004000U)     /*!< Base address of module ADC0 */
#define ADC1_BASE                      (0x40006000U)     /*!< Base address of module ADC1 */
#define COMP0_BASE                     (0x40008000U)     /*!< Base address of module COMP0 */
#define COMP1_BASE                     (0x4000A000U)     /*!< Base address of module COMP1 */
#define VREF_BASE                      (0x40030000U)     /*!< Base address of module VREF */
#define WWDT0_BASE                     (0x40080000U)     /*!< Base address of module WWDT0 */
#define WWDT1_BASE                     (0x40082000U)     /*!< Base address of module WWDT1 */
#define TIMG0_BASE                     (0x40084000U)     /*!< Base address of module TIMG0 */
#define TIMG1_BASE                     (0x40086000U)     /*!< Base address of module TIMG1 */
#define TIMG8_BASE                     (0x40090000U)     /*!< Base address of module TIMG8 */
#define LFSS_BASE                      (0x40094000U)     /*!< Base address of module LFSS */
#define RTC_B_BASE                     (0x40094000U)     /*!< Base address of module RTC_B */
#define IWDT_BASE                      (0x40094000U)     /*!< Base address of module IWDT */
#define GPIOA_BASE                     (0x400A0000U)     /*!< Base address of module GPIOA */
#define GPIOB_BASE                     (0x400A2000U)     /*!< Base address of module GPIOB */
#define KEYSTORECTL_BASE               (0x400AC000U)     /*!< Base address of module KEYSTORECTL */
#define SYSCTL_BASE                    (0x400AF000U)     /*!< Base address of module SYSCTL */
#define TIMB0_BASE                     (0x400B8000U)     /*!< Base address of module TIMB0 */
#define TIMB1_BASE                     (0x400BA000U)     /*!< Base address of module TIMB1 */
#define DEBUGSS_BASE                   (0x400C7000U)     /*!< Base address of module DEBUGSS */
#define FLASHCTL_BASE                  (0x400CD000U)     /*!< Base address of module FLASHCTL */
#define CPUSS_BASE                     (0x40400000U)     /*!< Base address of module CPUSS */
#define MATHACL_BASE                   (0x40410000U)     /*!< Base address of module MATHACL */
#define WUC_BASE                       (0x40424000U)     /*!< Base address of module WUC */
#define IOMUX_BASE                     (0x40428000U)     /*!< Base address of module IOMUX */
#define DMA_BASE                       (0x4042A000U)     /*!< Base address of module DMA */
#define CRCP0_BASE                     (0x40440000U)     /*!< Base address of module CRCP0 */
#define AESADV_BASE                    (0x40442000U)     /*!< Base address of module AESADV */
#define CANFD0_BASE                    (0x40508000U)     /*!< Base address of module CANFD0 */
#define ADC0_SVT_BASE                  (0x4055A000U)     /*!< Base address of module ADC0_SVT */
#define ADC1_SVT_BASE                  (0x4055C000U)     /*!< Base address of module ADC1_SVT */
#define TIMA0_BASE                     (0x40860000U)     /*!< Base address of module TIMA0 */
#define TIMA1_BASE                     (0x40862000U)     /*!< Base address of module TIMA1 */
#define UC4_UART_BASE                  (0x40A04000U)     /*!< Base address of module UC4_UART */
#define UC0_UART_BASE                  (0x40A06000U)     /*!< Base address of module UC0_UART */
#define UC5_UART_BASE                  (0x40A08000U)     /*!< Base address of module UC5_UART */
#define UC0_I2CC_BASE                  (0x40A26000U)     /*!< Base address of module UC0_I2CC */
#define UC5_I2CC_BASE                  (0x40A28000U)     /*!< Base address of module UC5_I2CC */
#define UC0_I2CT_BASE                  (0x40A46000U)     /*!< Base address of module UC0_I2CT */
#define UC5_I2CT_BASE                  (0x40A48000U)     /*!< Base address of module UC5_I2CT */
#define UC4_SPI_BASE                   (0x40A64000U)     /*!< Base address of module UC4_SPI */
#define UC4_BASE                       (0x40A84000U)     /*!< Base address of module UC4 */
#define UC0_BASE                       (0x40A86000U)     /*!< Base address of module UC0 */
#define UC5_BASE                       (0x40A88000U)     /*!< Base address of module UC5 */
#define SPG0_BASE                      (0x40A9F000U)     /*!< Base address of module SPG0 */
#define UC9_UART_BASE                  (0x40B04000U)     /*!< Base address of module UC9_UART */
#define UC2_SPI_BASE                   (0x40B60000U)     /*!< Base address of module UC2_SPI */
#define UC2_BASE                       (0x40B80000U)     /*!< Base address of module UC2 */
#define UC9_BASE                       (0x40B84000U)     /*!< Base address of module UC9 */
#define FACTORYREGION_BASE             (0x41C40000U)     /*!< Base address of module FACTORYREGION */

