TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0g321x.h
/******************************************************************************
* SYS parameters                                                              *
******************************************************************************/

#define CRCP_SYS_CRC32_ENABLE                         (1)       /* !< Parameter to exclude or include 32-bit CRC. */
#define DMA_SYS_N_DMA_CHANNEL                         (9)       /* !< Number of DMA channels implemented in DMA. */
#define DMA_SYS_N_DMA_FULL_CHANNEL                    (5)       /* !< Number of FULL-DMA channels implemented in DMA. If
                                                      SYS_N_DMA_CHANNEL is larger than SYS_N_DMA_FULL_CHANNEL, the
                                                      remaining channel will be BASIC channel with limited functionality. */
#define DMA_SYS_MMR_AUTO                              (1)       /* !< Boolean for if auto enable channels implemented in DMA. */
#define DMA_SYS_MMR_EM                                (1)       /* !< Boolean for if extended mode channels implemented in DMA. */
#define DMA_SYS_MMR_LLONG                             (1)       /* !< Boolean for if channels implemented in DMA with 128-bit access. */
#define DMA_SYS_MMR_STRIDE                            (1)       /* !< Boolean for if channels implemented in DMA with stride mode. */
#define FLASHCTL_SYS_DATAWIDTH                        (64)      /* !< Data bit width of a single flash word:    Minimum: 64    Maximum:
                                                      128 */
#define FLASHCTL_SYS_WEPROTBWIDTH                     (16)      /* !< Bit width of WEPROTB register. */
#define FLASHCTL_SYS_WEPROTAWIDTH                     (0)       /* !< Bit width of WEPROTA register. */
#define FLASHCTL_SYS_WEPROTCWIDTH                     (0)       /* !< Bit width of WEPROTC register. */
#define COMP_SYS_DACOUT_EN                            (1)       /* !< Boolean for if 8-bit DAC output to pin is available */


/******************************************************************************
* DMA Triggers                                                                *
******************************************************************************/

/* External DMA Triggers */
#define DMA_SOFTWARE_TRIG                             (0)
#define DMA_GENERIC_SUB0_TRIG                         (1)
#define DMA_GENERIC_SUB1_TRIG                         (2)
#define DMA_AESADV_AES_0_TRIG                         (3)
#define DMA_AESADV_AES_1_TRIG                         (4)
#define DMA_UC4_RX_BD_TRIG                            (5)
#define DMA_UC4_TX_BD_TRIG                            (6)
#define DMA_UC0_RX_BD_TRIG                            (7)
#define DMA_UC0_TX_BD_TRIG                            (8)
#define DMA_UC5_RX_BD_TRIG                            (9)
#define DMA_UC5_TX_BD_TRIG                            (10)
#define DMA_UC2_RX_BD_TRIG                            (11)
#define DMA_UC2_TX_BD_TRIG                            (12)
#define DMA_UC9_RX_BD_TRIG                            (13)
#define DMA_UC9_TX_BD_TRIG                            (14)
#define DMA_ADC0_EVT_GEN_BD_TRIG                      (15)
#define DMA_ADC1_EVT_GEN_BD_TRIG                      (16)

/* Internal DMA Triggers */
#define DMA_CH_0_TRIG                                 (0)
#define DMA_CH_1_TRIG                                 (1)
#define DMA_CH_2_TRIG                                 (2)
#define DMA_CH_3_TRIG                                 (3)
#define DMA_CH_4_TRIG                                 (4)
#define DMA_CH_5_TRIG                                 (5)
#define DMA_CH_6_TRIG                                 (6)
#define DMA_CH_7_TRIG                                 (7)
#define DMA_CH_8_TRIG                                 (8)



/******************************************************************************
* IOMUX Pin Definitions                                                       *
******************************************************************************/

typedef enum IOMUX_PINCM
{
  IOMUX_PINCM1         = (0),
  IOMUX_PINCM2         = (1),
  IOMUX_PINCM3         = (2),
  IOMUX_PINCM4         = (3),
  IOMUX_PINCM5         = (4),
  IOMUX_PINCM6         = (5),
  IOMUX_PINCM7         = (6),
  IOMUX_PINCM8         = (7),
  IOMUX_PINCM9         = (8),
  IOMUX_PINCM10        = (9),
  IOMUX_PINCM11        = (10),
  IOMUX_PINCM12        = (11),
  IOMUX_PINCM13        = (12),
  IOMUX_PINCM14        = (13),
  IOMUX_PINCM15        = (14),
  IOMUX_PINCM16        = (15),
  IOMUX_PINCM17        = (16),
  IOMUX_PINCM18        = (17),
  IOMUX_PINCM19        = (18),
  IOMUX_PINCM20        = (19),
  IOMUX_PINCM21        = (20),
  IOMUX_PINCM22        = (21),
  IOMUX_PINCM23        = (22),
  IOMUX_PINCM24        = (23),
  IOMUX_PINCM25        = (24),
  IOMUX_PINCM26        = (25),
  IOMUX_PINCM27        = (26),
  IOMUX_PINCM28        = (27),
  IOMUX_PINCM29        = (28),
  IOMUX_PINCM30        = (29),
  IOMUX_PINCM31        = (30),
  IOMUX_PINCM32        = (31),
  IOMUX_PINCM33        = (32),
  IOMUX_PINCM34        = (33),
  IOMUX_PINCM35        = (34),
  IOMUX_PINCM36        = (35),
  IOMUX_PINCM37        = (36),
  IOMUX_PINCM38        = (37),
  IOMUX_PINCM39        = (38),
  IOMUX_PINCM40        = (39),
  IOMUX_PINCM41        = (40),
  IOMUX_PINCM42        = (41),
  IOMUX_PINCM43        = (42),
  IOMUX_PINCM44        = (43),
  IOMUX_PINCM45        = (44),
  IOMUX_PINCM46        = (45),
  IOMUX_PINCM47        = (46),
  IOMUX_PINCM48        = (47),
  IOMUX_PINCM49        = (48),
  IOMUX_PINCM50        = (49),
  IOMUX_PINCM51        = (50),
  IOMUX_PINCM52        = (51),
  IOMUX_PINCM53        = (52),
  IOMUX_PINCM54        = (53),
  IOMUX_PINCM55        = (54),
  IOMUX_PINCM56        = (55),
  IOMUX_PINCM57        = (56),
  IOMUX_PINCM58        = (57),
  IOMUX_PINCM59        = (58),
  IOMUX_PINCM60        = (59),
} IOMUX_PINCM;


/* IOMUX_PINCM1[PF] Bits */
#define IOMUX_PINCM1_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM1_PF_GPIOA_DIO00                   ((uint32_t)0X00000001)
#define IOMUX_PINCM1_PF_UC4_PICO                      ((uint32_t)0X00000002)
#define IOMUX_PINCM1_PF_UC4_TX                        ((uint32_t)0X00000002)
#define IOMUX_PINCM1_PF_UC0_SDA                       ((uint32_t)0X00000003)
#define IOMUX_PINCM1_PF_UC0_TX                        ((uint32_t)0X00000003)
#define IOMUX_PINCM1_PF_TIMA0_CCP0                    ((uint32_t)0X00000004)
#define IOMUX_PINCM1_PF_TIMA_FAULT1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM1_PF_SYSCTL_FCC_IN                 ((uint32_t)0X00000006)
#define IOMUX_PINCM1_PF_TIMG8_CCP1                    ((uint32_t)0X00000007)
#define IOMUX_PINCM1_PF_TIMG0_CCP0                    ((uint32_t)0X00000009)

/* IOMUX_PINCM2[PF] Bits */
#define IOMUX_PINCM2_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM2_PF_GPIOA_DIO01                   ((uint32_t)0X00000001)
#define IOMUX_PINCM2_PF_UC4_SCLK                      ((uint32_t)0X00000002)
#define IOMUX_PINCM2_PF_UC4_RX                        ((uint32_t)0X00000002)
#define IOMUX_PINCM2_PF_UC0_SCL                       ((uint32_t)0X00000003)
#define IOMUX_PINCM2_PF_UC0_RX                        ((uint32_t)0X00000003)
#define IOMUX_PINCM2_PF_TIMA0_CCP1                    ((uint32_t)0X00000004)
#define IOMUX_PINCM2_PF_TIMA_FAULT2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM2_PF_TIMG8_IDX                     ((uint32_t)0X00000006)
#define IOMUX_PINCM2_PF_TIMG8_CCP0                    ((uint32_t)0X00000007)
#define IOMUX_PINCM2_PF_TIMG0_CCP1                    ((uint32_t)0X00000009)
#define IOMUX_PINCM2_PF_UC2_CS3                       ((uint32_t)0X0000000A)

/* IOMUX_PINCM3[PF] Bits */
#define IOMUX_PINCM3_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM3_PF_GPIOA_DIO28                   ((uint32_t)0X00000001)
#define IOMUX_PINCM3_PF_UC4_PICO                      ((uint32_t)0X00000002)
#define IOMUX_PINCM3_PF_UC4_TX                        ((uint32_t)0X00000002)
#define IOMUX_PINCM3_PF_UC0_SDA                       ((uint32_t)0X00000003)
#define IOMUX_PINCM3_PF_UC0_TX                        ((uint32_t)0X00000003)
#define IOMUX_PINCM3_PF_TIMA0_CCP3                    ((uint32_t)0X00000004)
#define IOMUX_PINCM3_PF_TIMA_FAULT0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM3_PF_TIMA0_CCP1                    ((uint32_t)0X00000007)
#define IOMUX_PINCM3_PF_TIMA1_CCP0                    ((uint32_t)0X00000009)

/* IOMUX_PINCM4[PF] Bits */
#define IOMUX_PINCM4_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM4_PF_GPIOA_DIO29                   ((uint32_t)0X00000001)
#define IOMUX_PINCM4_PF_UC5_SCL                       ((uint32_t)0X00000002)
#define IOMUX_PINCM4_PF_UC5_RX                        ((uint32_t)0X00000002)
#define IOMUX_PINCM4_PF_UC0_RTS                       ((uint32_t)0X00000003)
#define IOMUX_PINCM4_PF_TIMG8_CCP0                    ((uint32_t)0X00000004)
#define IOMUX_PINCM4_PF_UC4_CS0                       ((uint32_t)0X00000007)
#define IOMUX_PINCM4_PF_UC4_CTS                       ((uint32_t)0X00000007)
#define IOMUX_PINCM4_PF_UC2_CS3                       ((uint32_t)0X00000008)
#define IOMUX_PINCM4_PF_TIMG1_CCP0                    ((uint32_t)0X0000000B)

/* IOMUX_PINCM5[PF] Bits */
#define IOMUX_PINCM5_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM5_PF_GPIOA_DIO30                   ((uint32_t)0X00000001)
#define IOMUX_PINCM5_PF_UC5_SDA                       ((uint32_t)0X00000002)
#define IOMUX_PINCM5_PF_UC5_TX                        ((uint32_t)0X00000002)
#define IOMUX_PINCM5_PF_UC0_CTS                       ((uint32_t)0X00000003)
#define IOMUX_PINCM5_PF_TIMG8_CCP1                    ((uint32_t)0X00000004)
#define IOMUX_PINCM5_PF_UC4_POCI                      ((uint32_t)0X00000007)
#define IOMUX_PINCM5_PF_UC4_RTS                       ((uint32_t)0X00000007)
#define IOMUX_PINCM5_PF_UC2_CS2                       ((uint32_t)0X00000008)
#define IOMUX_PINCM5_PF_TIMG1_CCP1                    ((uint32_t)0X0000000B)

/* IOMUX_PINCM6[PF] Bits */
#define IOMUX_PINCM6_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM6_PF_GPIOA_DIO31                   ((uint32_t)0X00000001)
#define IOMUX_PINCM6_PF_UC4_SCLK                      ((uint32_t)0X00000002)
#define IOMUX_PINCM6_PF_UC4_RX                        ((uint32_t)0X00000002)
#define IOMUX_PINCM6_PF_UC0_SCL                       ((uint32_t)0X00000003)
#define IOMUX_PINCM6_PF_UC0_RX                        ((uint32_t)0X00000003)
#define IOMUX_PINCM6_PF_TIMA0_CCP3_CMPL               ((uint32_t)0X00000004)
#define IOMUX_PINCM6_PF_SYSCTL_CLK_OUT                ((uint32_t)0X00000006)
#define IOMUX_PINCM6_PF_UC2_CS3                       ((uint32_t)0X00000008)
#define IOMUX_PINCM6_PF_TIMA1_CCP1                    ((uint32_t)0X0000000B)

