TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0g321x.h
/* IOMUX_PINCM21[PF] Bits */
#define IOMUX_PINCM21_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM21_PF_GPIOA_DIO10                  ((uint32_t)0X00000001)
#define IOMUX_PINCM21_PF_UC4_PICO                     ((uint32_t)0X00000002)
#define IOMUX_PINCM21_PF_UC4_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM21_PF_UC2_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM21_PF_UC0_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM21_PF_UC0_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM21_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM21_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM21_PF_TIMG0_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM21_PF_UC5_SDA                      ((uint32_t)0X00000008)
#define IOMUX_PINCM21_PF_UC5_TX                       ((uint32_t)0X00000008)
#define IOMUX_PINCM21_PF_TIMA_FAULT1                  ((uint32_t)0X0000000A)
#define IOMUX_PINCM21_PF_TIMA1_CCP0                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM22[PF] Bits */
#define IOMUX_PINCM22_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM22_PF_GPIOA_DIO11                  ((uint32_t)0X00000001)
#define IOMUX_PINCM22_PF_UC4_SCLK                     ((uint32_t)0X00000002)
#define IOMUX_PINCM22_PF_UC4_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM22_PF_UC2_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM22_PF_UC0_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM22_PF_UC0_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM22_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM22_PF_COMP0_OUT                    ((uint32_t)0X00000006)
#define IOMUX_PINCM22_PF_TIMG0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM22_PF_UC5_SCL                      ((uint32_t)0X00000008)
#define IOMUX_PINCM22_PF_UC5_RX                       ((uint32_t)0X00000008)
#define IOMUX_PINCM22_PF_TIMA_FAULT0                  ((uint32_t)0X0000000A)
#define IOMUX_PINCM22_PF_TIMA1_CCP1                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM23[PF] Bits */
#define IOMUX_PINCM23_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM23_PF_GPIOB_DIO06                  ((uint32_t)0X00000001)
#define IOMUX_PINCM23_PF_UC5_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM23_PF_UC5_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM23_PF_UC4_CS0                      ((uint32_t)0X00000003)
#define IOMUX_PINCM23_PF_UC4_CTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM23_PF_TIMG8_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM23_PF_UC0_CTS                      ((uint32_t)0X00000006)
#define IOMUX_PINCM23_PF_TIMA_FAULT2                  ((uint32_t)0X00000008)
#define IOMUX_PINCM23_PF_UC2_CS1                      ((uint32_t)0X00000009)
#define IOMUX_PINCM23_PF_TIMA1_CCP0_CMPL              ((uint32_t)0X0000000C)

/* IOMUX_PINCM24[PF] Bits */
#define IOMUX_PINCM24_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM24_PF_GPIOB_DIO07                  ((uint32_t)0X00000001)
#define IOMUX_PINCM24_PF_UC5_SCL                      ((uint32_t)0X00000002)
#define IOMUX_PINCM24_PF_UC5_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM24_PF_UC4_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM24_PF_UC4_RTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM24_PF_TIMG8_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM24_PF_UC0_RTS                      ((uint32_t)0X00000006)
#define IOMUX_PINCM24_PF_UC2_CS2                      ((uint32_t)0X00000009)
#define IOMUX_PINCM24_PF_TIMA1_CCP1_CMPL              ((uint32_t)0X0000000C)

/* IOMUX_PINCM25[PF] Bits */
#define IOMUX_PINCM25_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM25_PF_GPIOB_DIO08                  ((uint32_t)0X00000001)
#define IOMUX_PINCM25_PF_UC4_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM25_PF_UC4_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM25_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM25_PF_COMP0_OUT                    ((uint32_t)0X00000006)
#define IOMUX_PINCM25_PF_COMP1_OUT                    ((uint32_t)0X00000008)

/* IOMUX_PINCM26[PF] Bits */
#define IOMUX_PINCM26_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM26_PF_GPIOB_DIO09                  ((uint32_t)0X00000001)
#define IOMUX_PINCM26_PF_UC4_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM26_PF_UC4_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM26_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM26_PF_TIMA0_CCP1                   ((uint32_t)0X00000006)

/* IOMUX_PINCM27[PF] Bits */
#define IOMUX_PINCM27_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM27_PF_GPIOB_DIO10                  ((uint32_t)0X00000001)
#define IOMUX_PINCM27_PF_TIMG0_CCP0                   ((uint32_t)0X00000002)
#define IOMUX_PINCM27_PF_TIMG8_CCP0                   ((uint32_t)0X00000003)
#define IOMUX_PINCM27_PF_COMP0_OUT                    ((uint32_t)0X00000004)
#define IOMUX_PINCM27_PF_COMP1_OUT                    ((uint32_t)0X0000000B)

/* IOMUX_PINCM28[PF] Bits */
#define IOMUX_PINCM28_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM28_PF_GPIOB_DIO11                  ((uint32_t)0X00000001)
#define IOMUX_PINCM28_PF_TIMG0_CCP1                   ((uint32_t)0X00000002)
#define IOMUX_PINCM28_PF_TIMG8_CCP1                   ((uint32_t)0X00000003)
#define IOMUX_PINCM28_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000004)

/* IOMUX_PINCM29[PF] Bits */
#define IOMUX_PINCM29_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM29_PF_GPIOB_DIO12                  ((uint32_t)0X00000001)
#define IOMUX_PINCM29_PF_UC9_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM29_PF_TIMA0_CCP2                   ((uint32_t)0X00000003)
#define IOMUX_PINCM29_PF_TIMA_FAULT1                  ((uint32_t)0X00000004)
#define IOMUX_PINCM29_PF_TIMA0_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM29_PF_TIMG1_CCP0                   ((uint32_t)0X0000000A)

/* IOMUX_PINCM30[PF] Bits */
#define IOMUX_PINCM30_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM30_PF_GPIOB_DIO13                  ((uint32_t)0X00000001)
#define IOMUX_PINCM30_PF_UC9_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM30_PF_TIMA0_CCP3                   ((uint32_t)0X00000003)
#define IOMUX_PINCM30_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM30_PF_UC4_CS0                      ((uint32_t)0X00000007)
#define IOMUX_PINCM30_PF_UC4_CTS                      ((uint32_t)0X00000007)
#define IOMUX_PINCM30_PF_TIMG1_CCP1                   ((uint32_t)0X0000000A)

/* IOMUX_PINCM31[PF] Bits */
#define IOMUX_PINCM31_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM31_PF_GPIOB_DIO14                  ((uint32_t)0X00000001)
#define IOMUX_PINCM31_PF_UC4_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM31_PF_UC4_RTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM31_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM31_PF_TIMG8_IDX                    ((uint32_t)0X00000006)
#define IOMUX_PINCM31_PF_UC2_CS3                      ((uint32_t)0X00000007)

